/* ***********************************************************************************************
* 
* Mac OS X EMBEDDED
* Localizable Strings
*
 *********************************************************************************************** */


/* Alert  strings */
"OK" = "OK";
"Cancel" = "Kumoa";

/* Password message and field*/
"Enter password" = "Syötä salasana.";
"Account Name:" = "Syötä nimi:";
"Password:" = "Syötä salasana:";
"Token:" = "Syötä merkki:";
"Incorrectly entered password" = "Syötit ehkä virheellisen salasanan.";
"Incorrectly entered token" = "Syötit ehkä virheellisen merkin.";

"Expired password" = "Salasana on vanhentunut.";
"Expired token" = "PIN-koodi on vanhentunut.";

"Incorrect password" = "Käyttäjätunnus tai salasana on ehkä virheellinen.";
"Incorrect token" = "Käyttäjätunnus tai merkki on ehkä virheellinen.";

"New password:" = "Syötä uusi salasana:";
"Confirm new password:" = "Syötä uusi salasana uudelleen:";
"New token:" = "Syötä uusi PIN-koodi:";
"Confirm new token:" = "Syötä uusi PIN-koodi uudelleen:";

"Retry name:" = "Syötä nimi:";
"Retry password:" = "Syötä salasana:";
"Retry token:" = "Syötä merkki:";

/* Reminder message, Default button, Cancel button */
"Reminder timeout" = "Tämä on muistutus siitä, että yhteys on yhä päällä. Haluatko säilyttää yhteyden?";
"Stay connected" = "Säilytä yhteys";
"Disconnect" = "Katkaise";

/* Notification window title */
"Network Connection" = "Verkkoyhteys";
"VPN Connection" = "VPN-yhteys";

